tbideas/illumi-arduino/boards.txt
# Board definition for Illumi board
illumi02.name=Illumi v0.2
illumi02.upload.protocol=avr109
illumi02.upload.maximum_size=28672
illumi02.upload.speed=57600
illumi02.upload.disable_flushing=true
illumi02.bootloader.low_fuses=0xff
illumi02.bootloader.high_fuses=0xd8
# Arduino Leonardo has extended fuse 0xCB
# but we want 0xCE to lower the brown-out detection level
illumi02.bootloader.extended_fuses=0xce
illumi02.bootloader.path=illu
illumi02.bootloader.file=Caterina.hex
illumi02.bootloader.unlock_bits=0x3F
illumi02.bootloader.lock_bits=0x2F
illumi02.build.mcu=atmega32u4
# Our frequency is 8 Mhz (because 3.3V)
illumi02.build.f_cpu=8000000L
illumi02.build.vid=0x2341
illumi02.build.pid=0x8036
illumi02.build.core=illumi
illumi02.build.variant=illumi
